[
    {
      "id": 1,
      "cover": "https://i.ibb.co/Ybt973j/Rectangle-2-2.png",
      "title": "Introduction to C Programming",
      "description": "C program is a set of instructions written in the C programming language, used for software development, ranging from simple calculations to complex applications.",
      "price": 15000,
      "credit": 1
    },
    {
      "id": 2,
      "cover": "https://i.ibb.co/RCNgX4J/Rectangle-2-3.png",
      "title": "Introduction to Algorithms",
      "description": "An algorithms program is a set of logical instructions designed to solve specific computational problems efficiently, fundamental in computer science and software development.",
      "price": 25000,
      "credit": 2
    },
    {
      "id": 3,
      "cover": "https://i.ibb.co/HqYs281/Rectangle-2-4.png",
      "title": "Introduction to C++ for DSA",
      "description": "C++ is a software application written in the C++ Language, allowing object-oriented programming and featuring extensive libraries for versatile development tasks.",
      "price": 10000,
      "credit": 10
    },
    {
      "id": 4,
      "cover": "https://i.ibb.co/zP5fYMr/Rectangle-3.png",
      "title": "Basic Data Structures",
      "description": "Basic data structures are fundamental components in computer science, including arrays, linked lists, stacks, and queues, used for organizing and managing data in various applications.",
      "price": 35000,
      "credit": 5
    },
    {
      "id": 5,
      "cover": "https://i.ibb.co/zNPJ2r1/Rectangle-2.png",
      "title": "Introduction to OOP Python",
      "description": "Object-Oriented Programming (OOP) in Python is a programming paradigm emphasizing the creation of reusable and structured code using classes, objects, and inheritance for efficient development.",
      "price": 19000,
      "credit": 5
    },
    {
      "id": 6,
      "cover": "https://i.ibb.co/JybvBk8/Rectangle-2-5.png",
      "title": "Software Engineering",
      "description": "Software engineering is the systematic process of designing, developing, testing, and maintaining software, focusing on reliability and efficient project management for successful applications.",
      "price": 23000,
      "credit": 2
    },
    {
      "id": 7,
      "cover": "https://i.ibb.co/WskDkd2/Rectangle-3-1.png",
      "title": "AWS, Cloud Computing",
      "description": "AWS is a leading cloud computing platform that provides on-demand computing resources, enabling scalable and cost-effective solutions for businesses and developers.",
      "price": 35000,
      "credit": 5
    },
    {
      "id": 8,
      "cover": "https://i.ibb.co/k46sVPb/Rectangle-2-1.png",
      "title": "Database (MySQL)",
      "description": "MySQL is a popular open-source relational database management system (RDBMS) used to store, manage, and retrieve structured data efficiently for various applications.",
      "price": 19000,
      "credit": 5
    },
    {
      "id": 9,
      "cover": "https://i.ibb.co/tBSyDQD/Rectangle-2-6.png",
      "title": "Problem-Solving Part",
      "description": "Problem-solving is a cognitive process of analyzing, evaluating, and finding solutions to challenges or questions, often involving logical reasoning and critical thinking skills.",
      "price": 23000,
      "credit": 2
    }
  ]